<img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /> 



<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />&nbsp;1&nbsp;Medium</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I01-NI-SG</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></td>

<td align="center"><sub><img width="15" height="15" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>"Any" service can enter your network from Private IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></sub></sub></sub>&nbsp;&nbsp;<h3><b>tf-test-1</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'validate -no-color': 
Error: "10.20.30.40/16" is not a valid IPv4 CIDR block; did you mean "10.20.0.0/16"?

  with aws_security_group.devsecops_test,
  on main.tf line 62, in resource "aws_security_group" "devsecops_test":
  62: resource "aws_security_group" "devsecops_test" {

: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></sub></sub></sub>&nbsp;&nbsp;<h3><b>tf-test-init-error</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'init': [31m[0mThere are some problems with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid quoted type constraints[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on variables.tf line 7, in variable "aliases":
[31m│[0m [0m   7:   type = [4m"list"[0m[0m
[31m│[0m [0m
[31m│[0m [0mTerraform 0.11 and earlier required type constraints to be given in quotes,
[31m│[0m [0mbut that form is now deprecated and will be removed in a future version of
[31m│[0m [0mTerraform. Remove the quotes around "list" and write list(string) instead
[31m│[0m [0mto explicitly indicate that the list elements are strings.
[31m╵[0m[0m
[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid quoted type constraints[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on variables.tf line 28, in variable "allowed_methods":
[31m│[0m [0m  28:   type = [4m"list"[0m[0m
[31m│[0m [0m
[31m│[0m [0mTerraform 0.11 and earlier required type constraints to be given in quotes,
[31m│[0m [0mbut that form is now deprecated and will be removed in a future version of
[31m│[0m [0mTerraform. Remove the quotes around "list" and write list(string) instead
[31m│[0m [0mto explicitly indicate that the list elements are strings.
[31m╵[0m[0m
[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid quoted type constraints[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on variables.tf line 88, in variable "locations":
[31m│[0m [0m  88:   type = [4m"list"[0m[0m
[31m│[0m [0m
[31m│[0m [0mTerraform 0.11 and earlier required type constraints to be given in quotes,
[31m│[0m [0mbut that form is now deprecated and will be removed in a future version of
[31m│[0m [0mTerraform. Remove the quotes around "list" and write list(string) instead
[31m│[0m [0mto explicitly indicate that the list elements are strings.
[31m╵[0m[0m
[0m[0m
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></sub></sub></sub>&nbsp;&nbsp;<h3><b>tf-test-plan-error</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'plan -input=false -no-color -out=/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_ALGOSEC_CODE_ANALYSIS/tf-test-plan-error\tmp\tf-tf-test-plan-error.out': 
Error: No value for required variable

  on variables.tf line 1:
   1: variable "custom_domain_name" {

The root module input variable "custom_domain_name" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></sub></sub></sub>&nbsp;&nbsp;<h3><b>tf-test-sg</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'validate -no-color': 
Error: "" is not a valid CIDR block: invalid CIDR address: 

  with aws_route_table.jenkins_master,
  on cloudflow.tf line 89, in resource "aws_route_table" "jenkins_master":
  89: resource "aws_route_table" "jenkins_master" {

: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></sub></sub></sub>&nbsp;&nbsp;<h3><b>tf-test</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />  I01-NI-SG</summary> 

### **Title:**
"Any" service can enter your network from Private IPs

### **Description:**
Allowing the "Any" service to enter your network is extremely risky since the "Any" service includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs.

### **Recommendation:**
Review all the rules that allow inbound traffic with "Any" service, and limit them to those services you actually require.  

### **Details:**

```

[
	{
		"toPort": 8082,
		"fromPort": 0,
		"ipProtocol": "-1",
		"ipRange": [
			169082880,
			169148415
		]
	}
]

```

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "cloudfront_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "this-is-a-test"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + include_cookies = false
          + prefix          = "logs"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "this-is-a-test"
          + origin_id           = "this-is-a-test/cloudflow"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_security_group.devsecops_test will be created
  + resource "aws_security_group" "devsecops_test" {
      + arn                    = (known after apply)
      + description            = "Display devsecops "
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.20.0.0/16",
                ]
              + description      = ""
              + from_port        = 7050
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 7655
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.20.0.0/16",
                ]
              + description      = "web app"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 8082
            },
        ]
      + name                   = "devsecops_test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cool_application"
        }
      + tags_all               = {
          + "Name" = "cool_application"
        }
      + vpc_id                 = "vpc-12345678"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_ALGOSEC_CODE_ANALYSIS/tf-test\tmp\tf-tf-test.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_ALGOSEC_CODE_ANALYSIS/tf-test\\tmp\\tf-tf-test.out"


```
<br>

</details> <!-- End Format Logs -->

</details><br>


Pusher: @alonnalgo
Action: `pull_request`
Working Directory: '/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example'
Workflow: 'Customer Repo CI/CD'